In [11]:
txt = 'babababbcbcbcbbcbcbcbcbcbbbaba'
counts = {'a':0, 'b':0, 'c':0}

for i in range(len(txt)):
    counts[txt[i]]+=1
    
counts

counts['d'] = 0
counts

{'a': 5, 'b': 17, 'c': 8, 'd': 0}

In [13]:
counts = {}
for i in range(len(txt)-1):
    key = txt[i]+txt[i+1]
    if key in counts.keys():
        counts[key] +=1
    else:
        counts[key]=1
        
counts

{'ab': 4, 'ba': 5, 'bb': 4, 'bc': 8, 'cb': 8}

In [30]:
txt = 'JSON (JavaScript Object Notation) is a lightweight data-interchange format.'
temp = txt
remove_list = ['(',')',',','.','-']
while True:
    words = temp.partition(' ')
    if words[2] == '':
        break
    w = words[0]
    
    for l in remove_list:
        w = w.replace(l,'')
    if len(w)>0:
        print(w)
    temp=words[2]

JSON
JavaScript
Object
Notation
is
a
lightweight
datainterchange

In [36]:
txt = 'JSON (JavaScript Object Notation) is a lightweight data-interchange format.'
key=''
for i in range(len(txt)-1):
    key += txt[i]+txt[i+1]
key

'JSSOONN  ((JJaavvaaSSccrriipptt  OObbjjeecctt  NNoottaattiioonn))  iiss  aa  lliigghhttwweeiigghhtt  ddaattaa--iinntteerrcchhaannggee  ffoorrmmaatt.'

In [38]:
txt = 'JSON (JavaScript Object Notation) is a lightweight data-interchange format.'
key=''
for i in range(len(txt)-1):
    key += txt[i]+txt[i]*3
key

'JJJJSSSSOOOONNNN    ((((JJJJaaaavvvvaaaaSSSSccccrrrriiiipppptttt    OOOObbbbjjjjeeeecccctttt    NNNNoooottttaaaattttiiiioooonnnn))))    iiiissss    aaaa    lllliiiigggghhhhttttwwwweeeeiiiigggghhhhtttt    ddddaaaattttaaaa----iiiinnnntttteeeerrrrcccchhhhaaaannnnggggeeee    ffffoooorrrrmmmmaaaatttt'

In [39]:
import pandas as pd

ids = [100, 200, 300, 301, 308]
names  = ['Ali', 'Veli', 'Ayse', 'Fatma', 'Gamze']
surnames  = ['Yilmaz', 'Gorali', 'Tasci', 'Bakkaloglu', 'Yilmaz']
ages   = [27,32,19,28,32]
gender = ['M','M','F','F','F']
city = ['Istanbul', 'Istanbul', 'Ankara', 'Istanbul', 'Izmir']

number_plate = [('Adana','01'), ('Eskisehir','26'), ('Istanbul', '34'), ('Ankara', '06'), ('Izmir', '35'), ('Denizli','20') ]
s = pd.Series(names)

In [61]:

df = pd.DataFrame(data={'Name': names, 'Surname': surnames, 'Age': ages, 'Gender': gender, 'City': city},
                  index=ids)
#df1 = df[[3,0,2,1]]
df1 = df
df = pd.DataFrame(number_plate, columns=['City','Plate'])
df2 = df
df3 = pd.DataFrame(data={'Name': names, 'Surname': surnames},index=range(1,len(names)+1))
df3

    Name     Surname
1    Ali      Yilmaz
2   Veli      Gorali
3   Ayse       Tasci
4  Fatma  Bakkaloglu
5  Gamze      Yilmaz

In [48]:
df1

     Age      City Gender   Name     Surname
100   27  Istanbul      M    Ali      Yilmaz
200   32  Istanbul      M   Veli      Gorali
300   19    Ankara      F   Ayse       Tasci
301   28  Istanbul      F  Fatma  Bakkaloglu
308   32     Izmir      F  Gamze      Yilmaz

In [50]:
df2

        City Plate
0      Adana    01
1  Eskisehir    26
2   Istanbul    34
3     Ankara    06
4      Izmir    35
5    Denizli    20

In [55]:
kordinat = [('Kadıköy','49.1','37.2'), ('Etiler','49.12','36.3'), ('Yeşilköy', '49.18','39.7') ]
df4 = pd.DataFrame(kordinat, columns=['Place','Latitude','Long'])
df4

      Place Latitude  Long
0   Kadıköy     49.1  37.2
1    Etiler    49.12  36.3
2  Yeşilköy    49.18  39.7

In [58]:
df4['Place']

0     Kadıköy
1      Etiler
2    Yeşilköy
Name: Place, dtype: object

In [59]:
df4[['Latitude','Long']]

  Latitude  Long
0     49.1  37.2
1    49.12  36.3
2    49.18  39.7

In [62]:
pd.merge(df1, df2, on='City',  how='inner')

   Age      City Gender   Name     Surname Plate
0   27  Istanbul      M    Ali      Yilmaz    34
1   32  Istanbul      M   Veli      Gorali    34
2   28  Istanbul      F  Fatma  Bakkaloglu    34
3   19    Ankara      F   Ayse       Tasci    06
4   32     Izmir      F  Gamze      Yilmaz    35

In [63]:
pd.merge(df1, df2, how='outer').sort_values('Plate')

    Age       City Gender   Name     Surname Plate
5   NaN      Adana    NaN    NaN         NaN    01
3  19.0     Ankara      F   Ayse       Tasci    06
7   NaN    Denizli    NaN    NaN         NaN    20
6   NaN  Eskisehir    NaN    NaN         NaN    26
0  27.0   Istanbul      M    Ali      Yilmaz    34
1  32.0   Istanbul      M   Veli      Gorali    34
2  28.0   Istanbul      F  Fatma  Bakkaloglu    34
4  32.0      Izmir      F  Gamze      Yilmaz    35

In [64]:
pd.merge(df1, df2, on='City',  how='inner')[['Name','Plate']]

    Name Plate
0    Ali    34
1   Veli    34
2  Fatma    34
3   Ayse    06
4  Gamze    35

In [65]:
pd.merge(df1, df2, on='City',  how='inner').sort_values('Name')

   Age      City Gender   Name     Surname Plate
0   27  Istanbul      M    Ali      Yilmaz    34
3   19    Ankara      F   Ayse       Tasci    06
2   28  Istanbul      F  Fatma  Bakkaloglu    34
4   32     Izmir      F  Gamze      Yilmaz    35
1   32  Istanbul      M   Veli      Gorali    34